"""
Дана строка, состоящая из слов, разделенных пробелами. Напишите программу,
которая подсчитывает количество слов в этой строке.
"""
# text = str(input())
# list_word = text.split(" ")
# print(list_word)

print(len(str(input()).split()))
