"""
На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в
строке.

"""
# my_str = input()
# my_set = set(my_str)
print(len(set(input())))
