"""
Онлайн-школа BEEGEEK 5 🌶️
Каждый ученик, обучающийся в онлайн-школе BEEGEEK изучает либо математику, либо информатику, либо оба этих предмета.
У руководителя школы есть списки учеников, изучающих каждый предмет. Случайно списки всех учеников перемешались.

Напишите программу, которая позволит руководителю выяснить, сколько учеников изучает только один предмет.

Формат входных данных
На вход программе в первых двух строках подаются числа mm и nn – количества учеников, изучающих математику и
информатику соответственно. Далее идут m+nm+n строк — фамилии учеников, изучающих математику и информатику, в
произвольном порядке.

Формат выходных данных
Программа должна вывести количество учеников, которые изучают только один предмет. Если таких учеников не окажется,
 то необходимо вывести NO.

Примечание. Гарантируется, что среди учеников школы BEEGEEK нет однофамильцев.

Тестовые данные 🟢
Sample Input 1:

2
3
Хохлов
Фадеев
Ершов
Ушаков
Хохлов
Sample Output 1:

3
"""
n = int(input())
m = int(input())
list_all = []
for i in range(n + m):
    list_all.append(input())
count_study_2 = 0
set_students = set()

for student in list_all:
    if student in set_students:
        count_study_2 += 1
    else:
        set_students.add(student)

count_study_1 = len(set_students) - count_study_2

if count_study_1 > 0:
    print(count_study_1)
else:
    print('NO')
